todo/app/controllers/delete_controller.rb

	def delete_marked
		@delete_marked = TodoList.where(:user_id => current_user.id).where(:completed => true).destroy_all
---
DELETE FROM "todo_lists" WHERE "todo_lists"."id" = ?  [["id", 3]]
SELECT "todo_lists".* FROM "todo_lists" WHERE "todo_lists"."user_id" = ? AND "todo_lists"."completed" = ?  [["user_id", 1], ["completed", 1]]

	def delete_all
		@delete_all = TodoList.where(:user_id => current_user.id).destroy_all
---
DELETE FROM "todo_lists" WHERE "todo_lists"."id" = ?  [["id", 1]]
SELECT "todo_lists".* FROM "todo_lists" WHERE "todo_lists"."user_id" = ?  [["user_id", 1]]