todo/app/controllers/todo_lists_controller.rb

SELECT "todo_lists".* FROM "todo_lists" WHERE "todo_lists"."user_id" = ? ORDER BY created_at DESC  [["user_id", 1]]
SELECT "todo_lists".* FROM "todo_lists" WHERE "todo_lists"."user_id" != ? AND "todo_lists"."private" = ? ORDER BY created_at DESC  [["user_id", 1], ["private", 0]]
---
    def index
        if user_signed_in?
            @todo_lists = TodoList.where(:user_id => current_user.id).order("created_at DESC")
            @others_lists = TodoList.where.not(:user_id => current_user.id).where(:private => false).order("created_at DESC")

INSERT INTO "todo_lists" ("description", "completed", "created_at", "updated_at", "user_id", "private", "unique_id") VALUES (?, ?, ?, ?, ?, ?, ?)
---
    def create
        @todo_list = current_user.todo_lists.build(todo_list_params)
        @todo_list.unique_id = Time.now.to_f

        respond_to do |format|
            if @todo_list.save

UPDATE "todo_lists" SET "completed" = ?, "updated_at" = ? WHERE "todo_lists"."id" = ?  [["completed", 1], ["updated_at", "2019-11-13 07:45:23.635545"], ["id", 8]]
---
    def update
        respond_to do |format|
            if @todo_list.update(todo_list_params)

SELECT "todo_lists".* FROM "todo_lists" WHERE "todo_lists"."id" = ?  [["id", 7]]
INSERT INTO "todo_lists" ("created_at", "updated_at", "user_id") VALUES (?, ?, ?)  [["created_at", "2019-11-12 23:17:17.480466"], ["updated_at", "2019-11-12 23:17:17.480466"], ["user_id", 1]]
---
    def favorite
        id = params[:id]
        type = params[:type]
        list = TodoList.where(:id => id)

        if type == "favorite"
            current_user.favorites << list